/**
 * —————— ！！请在这个文件里，在对应的位置输入对应的内容！！ ——————
 */

//机器人模块
let robotPush = {
        open: false, //是否需要推送时增加开头语，需要填true，否则填false （不需要加引号）
        key: `07f4c380-726a-413e-b44d-2dec5015449bb`//这里输入机器人的Webhook地址，注意不要填错了
    }

//开头语模块
let start = {
    open: false, //是否需要推送时增加开头语，需要填true，否则填false （不需要加引号）
    content: '大家好🐷', //开头语内容，可以输入emoji表情，可以使用 \n 来换行
}

//福利彩票模块
let lottery = {
    open: true, //是否需要推送福利彩票，需要填true，否则填false （不需要加引号，填了false的话下面新闻有关的配置项就不用填了）
    SD: [1, 2, 3, 4, 5, 6, 0], //福彩3D  每日21:15开奖
    KL8: [1, 2, 3, 4, 5, 6, 0],//快乐8   每日21:30开奖
    QLC: [1, 3, 5], //七乐彩 每周一、三、五21:15开奖
    SSQ: [2, 4, 0], //双色球 每周二、四、日21:15开奖
}

//新闻模块
let news = {
    open: true, //是否需要推送新闻，需要填true，否则填false （不需要加引号，填了false的话下面新闻有关的配置项就不用填了）
    size: 8, //想要多少条的新闻
}

//天气模块
let weather = {
    open: false, //是否需要推送天气，需要填true，否则填false （不需要加引号，填了false的话下面天气有关的配置项就不用填了）
	key: 'd8045d9dd3eb0db5dc3f2a807a6a64e0', //这里输入天气申请到的key
    //工作日推送实况天气
    //城市编码, 滨江区330108 西湖区330106 余杭区330110
    //城市编码, 吴兴区330502 枞阳县340722，怀宁县340822 鼓楼区350102
    base_data: [ //气象类型，base:返回实况天气
        {
            city_code: 330110,//城市编码, 余杭区330110
            time: ['AM'],//AM：上午, MM：中午，PM：下午
            day: [1, 2, 3, 4, 5, 6, 0]//周一 ~ 周五 分别对应 0~6
        },
        {
            city_code: 330502,//城市编码, 吴兴区330502
            time: ['AM'],//AM：上午, MM：中午，PM：下午
            day: [1, 2, 3, 4, 5, 6, 0]//周一 ~ 周五 分别对应 0~6
        },
        {
            city_code: 340722,//城市编码, 枞阳县340722
            time: ['AM'],//AM：上午, MM：中午，PM：下午
            day: [1, 2, 3, 4, 5, 6, 0]//周一 ~ 周五 分别对应 0~6
        },
        {
            city_code: 350102,//城市编码, 鼓楼区350102
            time: ['AM'],//AM：上午, MM：中午，PM：下午
            day: [1, 2, 3, 4, 5, 6, 0]//周一 ~ 周五 分别对应 0~6
        }
    ],
    //周末推送未来天气
    all_data: [ //气象类型，all:返回未来4天预报天气
        {
            city_code: 340722,//城市编码, 枞阳县340722
            time: ['PM'],//AM：上午, MM：中午，PM：下午
            day: [0,4]//周一 ~ 周日 分别对应 0~6
        },
        {
            city_code: 330502,//城市编码, 吴兴区330502
            time: ['PM'],//AM：上午, MM：中午，PM：下午
            day: [1,5]//周一 ~ 周日 分别对应 0~6
        },
        {
            city_code: 350102,//城市编码, 鼓楼区350102
            time: ['PM'],//AM：上午, MM：中午，PM：下午
            day: [2,6]//周一 ~ 周日 分别对应 0~6
        },
        {
            city_code: 340822,//城市编码, 怀宁县340822
            time: ['PM'],//AM：上午, MM：中午，PM：下午
            day: [3]//周一 ~ 周日 分别对应 0~6
        }
    ]
}

//纪念日模块
let daily = {
    open: true,//是否需要推送纪念日，需要填true，否则填false （不需要加引号）
    anniversary: [//纪念日/生日列表
        {
            name: '恋爱纪念日',
            date: '2019-03-27',
            type: 0
        },
        {
            name: '领证纪念日',
            date: '2021-07-14',
            type: 1
        },
        {
            name: '订婚纪念日',
            date: '2021-12-28',
            type: 2
        },
        {
            name: '结婚吉日',
            date: '2023-12-16',
            type: 2
        },
        {
            name: 'Dad生日',
            date: '1970-02-14',
            type: 3
        },
        {
            name: 'Mon生日',
            date: '1972-01-12',
            type: 3
        },
        {
            name: 'Father生日',
            date: '1969-11-23',
            type: 3
        },
        {
            name: 'Mother生日',
            date: '1971-02-03',
            type: 3
        },
        {
            name: 'Howe生日',
            date: '1992-09-18',
            type: 3
        },
        {
            name: 'Lover生日',
            date: '1995-10-01',
            type: 3
        },
        {
            name: 'Brother生日',
            date: '2000-12-15',
            type: 3
        }
    ],
    legal: [//法定节假日列表(每年根据国务院公布情况)
        {
            name:'元旦',
            date: '01-01',
            repair: 0,
            holiday: ['12-31','01-01','01-02']
        },
        {
            name:'除夕',
            date: '01-21',
            repair: 0,
            holiday: ['01-21']
        },
        {
            name:'春节',
            date: '01-22',
            repair: ['01-28','01-29'],
            holiday: ['01-22','01-23','01-24','01-25','01-26','01-27']
        },
        {
            name:'清明节',
            date: '04-05',
            repair: ['04-23'],
            holiday: ['04-05']
        },
        {
            name:'劳动节',
            date: '05-01',
            repair: ['04-23','05-06'],
            holiday: ['04-29','04-30','05-01','05-02','05-03']
        },
        {
            name:'端午节',
            date: '06-22',
            repair: ['06-25'],
            holiday: ['06-22','06-23','06-24']
        },
        {
            name:'中秋节',
            date: '09-29',
            repair: ['10-07'],
            holiday: ['09-29','09-30']
        },
        {
            name:'国庆节',
            date: '10-01',
            repair: ['10-08'],
            holiday: ['10-01','10-02','10-03','10-04','10-05','10-06']
        }
    ],
    sFtv: [//阳历节日列表
        {
            name:'情人节',
            date: '02-14'
        },
        {
            name:'妇女节',
            date: '03-08'
        },
        {
            name:'植树节',
            date: '03-12'
        },
        {
            name:'消费者权益日',
            date: '03-15'
        },
        {
            name:'愚人节',
            date: '04-01'
        },

        {
            name:'青年节',
            date: '05-04'
        },
        {
            name:'护士节',
            date: '05-12'
        },
        {
            name:'网络情人节',
            date: '05-20'
        },
        {
            name:'儿童节',
            date: '06-01'
        },
        {
            name:'香港回归纪念日',
            date: '07-01'
        },
        {
            name:'建军节',
            date: '08-01'
        },
        {
            name:'抗战胜利纪念日',
            date: '09-03'
        },
        {
            name:'教师节',
            date: '09-10'
        },
        {
            name:'九一八事变纪念日',
            date: '09-18'
        },
        {
            name:'1024程序员节',
            date: '10-24'
        },
        {
            name:'万圣节',
            date: '11-01'
        },
        {
            name:'网络单身节',
            date: '11-11'
        },
        {
            name:'国家公祭日',
            date: '12-13'
        },
        {
            name:'澳门回归纪念日',
            date: '12-20'
        },
        {
            name:'平安夜',
            date: '12-24'
        },
        {
            name:'圣诞节',
            date: '12-25'
        },
    ],
    lFtv: [//阴历节日列表
        {
            name:'上元节',
            date: '01-15'
        },
        {
            name:'龙头节',
            date: '02-02'
        },
        {
            name:'佛诞节',
            date: '04-08'
        },
        {
            name:'七夕节',
            date: '07-07'
        },
        {
            name:'中元节',
            date: '07-15'
        },
        {
            name:'重阳节',
            date: '09-09'
        },
        {
            name:'下元节',
            date: '10-15'
        },
        {
            name:'腊八节',
            date: '12-08'
        },
        {
            name:'北小年',
            date: '12-23'
        },
        {
            name:'南小年',
            date: '12-24'
        },
        {
            name:'江浙沪小年',
            date: '12-29'
        }
    ],
    term: [//二十四节气列表
        {
            sort: 1,
            name:'立春',
            month: '02'
        },
        {
            sort: 2,
            name:'雨水',
            month: '02'
        },
        {
            sort: 3,
            name:'惊蛰',
            month: '03'
        },
        {
            sort: 4,
            name:'春分',
            month: '03'
        },
        {
            sort: 5,
            name:'谷雨',
            month: '04'
        },
        {
            sort: 7,
            name:'立夏',
            month: '05'
        },
        {
            sort: 8,
            name:'小满',
            month: '05'
        },
        {
            sort: 9,
            name:'芒种',
            month: '06'
        },
        {
            sort: 10,
            name:'夏至',
            month: '06'
        },
        {
            sort: 11,
            name:'小暑',
            month: '07'
        },
        {
            sort: 12,
            name:'大暑',
            month: '07'
        },
        {
            sort: 13,
            name:'立秋',
            month: '08'
        },
        {
            sort: 14,
            name:'处暑',
            month: '08'
        },
        {
            sort: 15,
            name:'白露',
            month: '09'
        },
        {
            sort: 16,
            name:'秋分',
            month: '09'
        },
        {
            sort: 17,
            name:'寒露',
            month: '10'
        },
        {
            sort: 18,
            name:'霜降',
            month: '10'
        },
        {
            sort: 19,
            name:'立冬',
            month: '11'
        },
        {
            sort: 20,
            name:'小雪',
            month: '11'
        },
        {
            sort: 21,
            name:'大雪',
            month: '12'
        },
        {
            sort: 22,
            name:'冬至',
            month: '12'
        },
        {
            sort: 23,
            name:'小寒',
            month: '01'
        },
        {
            sort: 24,
            name:'大寒',
            month: '01'
        }
    ],
    special: [//特殊节日列表
        {
            name:'母亲节',
            date: '05/2/7'
        },
        {
            name:'父亲节',
            date: '06/3/7'
        },
        {
            name:'感恩节',
            date: '11/4/4'
        }
    ]
}

//汽油价格模块
let gasoline = {
    open: true,//是否需要汽油价格，需要填true，否则填false （不需要加引号）
    province: ['浙江','安徽','福建'],//地区名称
    model: ['0号柴油','92号汽油','95号汽油','98号汽油'],//汽油型号
}

//结束语模块
let end = {
    open: false,//是否需要推送时增加结束语，需要填true，否则填false  （不需要加引号）
    content: '本通知 By 狂欢马克思',//结束语内容，可以输入emoji表情，可以使用 \n 来换行
    time: '通知时间: '
}

//课表推送模块
let classTable = {
    open: true,//是否需要推送时增加课表，需要填true，否则填false  （不需要加引号）
    homework: 0, // homework: 0,
    computer: [//22春计算机本-课程列表
        {
            name: '学士学位英语',//课程名称
            teacher: '陈仙柱',//辅导老师
            exam: {
                type: 2, //考试方式 1:纸质闭卷 2:上机闭卷
                date: '2023-10-28',
                time: '09:00 - 11:00',//考试时间
                place: '浙江开放大学'//考试地点
            },
            classList: [
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-09-20',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                }
            ]
        },
        {
            name: '数学文化',//课程名称
            teacher: '韩玉娟',//辅导老师
            exam: 0,
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-12',
                    time: '18:30 - 20:00',//课程时间
                    place: '浙江开放大学-行政楼A702'//上课地点
                }
            ]
        },
        {
            name: '计算机网络',//课程名称
            teacher: '蒋融融',//辅导老师
            exam: 0,
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-11-02',
                    time: '18:30 - 20:00',//课程时间
                    place: '浙江开放大学-行政楼A717'//上课地点
                }
            ]
        },
        {
            name: '人工智能导论',//课程名称
            teacher: '余燕芳',//辅导老师
            exam: 0,
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-09',
                    time: '18:30 - 20:00',//课程时间
                    place: '浙江开放大学-行政楼A706'//上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-16',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-23',
                    time: '18:30 - 20:00',//课程时间
                    place: '浙江开放大学-行政楼A706'//上课地点
                }
            ]
        },
        {
            name: '数据库应用技术',//课程名称
            teacher: '刘旭东',//辅导老师
            exam: 0,
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-09-20',
                    time: '18:30 - 20:00',//课程时间
                    place: '浙江开放大学-行政楼A713'//上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-09-27',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-11',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-18',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-25',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-11-01',
                    time: '18:30 - 20:00',//课程时间
                    place: '浙江开放大学-行政楼A713'//上课地点
                }
            ]
        }
    ],
    hr: [//22春行政专-课程列表
        {
            name: '监督学',//课程名称
            teacher: '俞丹',//辅导老师
            exam: 0,
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-30',
                    time: '18:30 - 20:50',//课程时间
                    place: '浙江开放大学-行政楼A702' //上课地点
                },
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-11-06',
                    time: '18:30 - 20:00',//课程时间
                    place: '浙江开放大学-行政楼A702' //上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-11-13',
                    time: '18:30 - 20:50',//课程时间
                    place: 0 //上课地点
                }
            ]
        },
        {
            name: '办公室管理',//课程名称
            teacher: '朱庆好',//辅导老师
            exam: 0,
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-12-14',
                    time: '18:30 - 20:50',//课程时间
                    place: '浙江开放大学-行政楼A709' //上课地点
                }
            ]
        },
        {
            name: '国家赔偿法',//课程名称
            teacher: '林卉',//辅导老师
            exam: 0,
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-15',
                    time: '09:05 - 11:25',//课程时间
                    place: '浙江开放大学-行政楼A702' //上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-16',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-23',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-29',
                    time: '09:05 - 11:25',//课程时间
                    place: '浙江开放大学-行政楼A702' //上课地点
                }
            ]
        },
        {
            name: '行政组织学',//课程名称
            teacher: '俞丹',//辅导老师
            exam: 0,
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-11-20',
                    time: '18:30 - 20:50',//课程时间
                    place: '浙江开放大学-行政楼A702' //上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-11-27',
                    time: '18:30 - 20:50',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-12-04',
                    time: '18:30 - 20:50',//课程时间
                    place: '浙江开放大学-行政楼A702' //上课地点
                }
            ]
        }
    ]
}

//是否需要艾特所有人
let atAll = false //是否需要艾特所有人，需要填true，否则填false （不需要加引号）

//彩虹屁模块
let sentence = {
    open: true,//是否需要彩虹屁文案，需要填true，否则填false （不需要加引号）
}

//下面的内容请勿改动
module.exports = { robotPush, start, news, lottery, weather, daily, gasoline, end, atAll, classTable, sentence }
