/**
 * —————— ！！请在这个文件里，在对应的位置输入对应的内容！！ ——————
 */

//机器人模块
let robotPush = {
        open: false, //是否需要推送时增加开头语，需要填true，否则填false （不需要加引号）
        key: `07f4c380-726a-413e-b44d-2dec5015449bb`//这里输入机器人的Webhook地址，注意不要填错了
    }

//开头语模块
let start = {
    open: false, //是否需要推送时增加开头语，需要填true，否则填false （不需要加引号）
    content: '大家好🐷', //开头语内容，可以输入emoji表情，可以使用 \n 来换行
}

//福利彩票模块
let lottery = {
    open: true, //是否需要推送福利彩票，需要填true，否则填false （不需要加引号，填了false的话下面新闻有关的配置项就不用填了）
    SD: [1, 2, 3, 4, 5, 6, 0], //福彩3D  每日21:15开奖
    KL8: [1, 2, 3, 4, 5, 6, 0],//快乐8   每日21:30开奖
    QLC: [1, 3, 5], //七乐彩 每周一、三、五21:15开奖
    SSQ: [2, 4, 0], //双色球 每周二、四、日21:15开奖
}

//新闻模块
let news = {
    open: false, //是否需要推送新闻，需要填true，否则填false （不需要加引号，填了false的话下面新闻有关的配置项就不用填了）
    size: 8, //想要多少条的新闻
}

//天气模块
let weather = {
    open: true, //是否需要推送天气，需要填true，否则填false （不需要加引号，填了false的话下面天气有关的配置项就不用填了）
	key: 'd5b029e10a22ed366640b200ad1207fa', //这里输入天气申请到的key
    //工作日推送实况天气
    //城市编码, 滨江区330108 西湖区330106 余杭区330110
    //城市编码, 吴兴区330502 枞阳县340722，怀宁县340822 鼓楼区350102
    base_data: [ //气象类型，base:返回实况天气
        {
            city_code: 330110,//城市编码, 余杭区330110
            time: ['AM'],//AM：上午, MM：中午，PM：下午
            day: [1, 2, 3, 4, 5, 6, 0]//周一 ~ 周五 分别对应 0~6
        },
        {
            city_code: 330502,//城市编码, 吴兴区330502
            time: ['AM'],//AM：上午, MM：中午，PM：下午
            day: [1, 2, 3, 4, 5, 6, 0]//周一 ~ 周五 分别对应 0~6
        },
        {
            city_code: 340722,//城市编码, 枞阳县340722
            time: ['AM'],//AM：上午, MM：中午，PM：下午
            day: [1, 2, 3, 4, 5, 6, 0]//周一 ~ 周五 分别对应 0~6
        }
        /*{
            city_code: 340722,//城市编码, 怀宁县340822
            time: ['AM'],//AM：上午, MM：中午，PM：下午
            day: [1, 2, 3, 4, 5, 6, 0]//周一 ~ 周五 分别对应 0~6
        },
        {
            city_code: 350102,//城市编码, 鼓楼区350102
            time: ['AM'],//AM：上午, MM：中午，PM：下午
            day: [1, 2, 3, 4, 5, 6, 0]//周一 ~ 周五 分别对应 0~6
        }*/
    ],
    //周末推送未来天气
    all_data: [ //气象类型，all:返回未来4天预报天气
        {
            city_code: 330502,//城市编码, 吴兴区330502
            time: ['PM'],//AM：上午, MM：中午，PM：下午
            day: [1,5]//周一 ~ 周日 分别对应 0~6
        },
        {
            city_code: 340822,//城市编码, 怀宁县340822
            time: ['PM'],//AM：上午, MM：中午，PM：下午
            day: [3]//周一 ~ 周日 分别对应 0~6
        }
        /*{
            city_code: 350102,//城市编码, 鼓楼区350102
            time: ['PM'],//AM：上午, MM：中午，PM：下午
            day: [2,6]//周一 ~ 周日 分别对应 0~6
        },
        {
            city_code: 340722,//城市编码, 枞阳县340722
            time: ['PM'],//AM：上午, MM：中午，PM：下午
            day: [0,4]//周一 ~ 周日 分别对应 0~6
        },*/
    ],
    clothes: [//季节穿衣搭配 按照阴历
        //夏季：04.01 - 08.30
        {
            name:'夏季搭配-1',
            night:'夏季睡衣',
            remark:'短袖衬衫、牛仔长裤',
            date: ['04-01','04-15'],
            num: '7'
        },
        {
            name:'夏季搭配-2',
            night:'夏季睡衣',
            remark:'T恤、牛仔长裤',
            date: ['04-08','04-23','05-15','06-01','06-15','07-01','07-15','08-01','08-15'],
            num: '7'
        },
        {
            name:'夏季搭配-3',
            night:'夏季睡衣',
            remark:'T恤、牛仔长裤',
            date: ['05-01','05-08','05-23','06-08','06-23','07-08','07-23','08-08','08-23'],
            num: '7'
        },
        //冬季：10.01 - 12.30 & 01.01 - 01.30
        {
            name:'冬季搭配-1',
            night:'冬季睡衣',
            remark:'羽绒服、牛仔长裤、厚款毛衣、保暖内衣',
            date: ['10-01'],
            num: '14'
        },
        {
            name:'冬季搭配-2',
            night:'冬季睡衣',
            remark:'外套、厚款毛衣、牛仔长裤、厚款内衣、长袖衬衫',
            date: ['10-16','11-16','12-16'],
            num: '14'
        },
        {
            name:'冬季搭配-3',
            night:'冬季睡衣',
            remark:'外套、厚款毛衣、厚款长裤、厚款内衣、长袖衬衫',
            date: ['11-01','12-01','01-01'],
            num: '14'
        },
        {
            name:'冬季搭配-4',
            night:'冬季睡衣',
            remark:'外套、加厚毛衣、内衣、西服',
            date: ['01-16'],
            num: '14'
        },
        //春季：02.01 - 03.30 前冷后热
        //秋季：09.01 - 09.30 前热后冷
        {
            name:'春季搭配-1',
            night:'春季睡衣',
            remark:'polo衫、厚款卫衣、薄款毛衣、长裤',
            date: ['02-01','02-8','02-16','02-23'],
            num: '7'
        },
        {
            name:'春季搭配-2',
            night:'春季睡衣',
            remark:'薄款卫衣、长裤、牛仔外套',
            date: ['03-01','03-08','03-16','03-23'],
            num: '7'
        },
        {
            name:'秋季搭配-1',
            night:'秋季睡衣',
            remark:'厚款毛衣、马甲、薄款羽绒服、牛仔外套',
            date: ['09-01','09-08','09-16','09-23'],
            num: '7'
        }
    ]
}

//纪念日模块
let daily = {
    open: true,//是否需要推送纪念日，需要填true，否则填false （不需要加引号）
    marriage: [//中国结婚纪年数列表
        {
            name: '纸婚',
            age: 1
        },
        {
            name: '棉婚',
            age: 2
        },
        {
            name: '皮婚',
            age: 3
        },
        {
            name: '花果婚',
            age: 4
        },
        {
            name: '木婚',
            age: 5
        },
        {
            name: '糖婚',
            age: 6
        },
        {
            name: '铁婚',
            age: 7
        },
        {
            name: '铜婚',
            age: 8
        },
        {
            name: '陶婚',
            age: 9
        },
        {
            name: '锡婚',
            age: 10
        },
        {
            name: '钢婚',
            age: 11
        },
        {
            name: '丝婚',
            age: 12
        },
        {
            name: '花边婚',
            age: 13
        },
        {
            name: '象牙婚',
            age: 14
        },
        {
            name: '水晶婚',
            age: 15
        },
        {
            name: '瓷婚',
            age: 20
        },
        {
            name: '银婚',
            age: 25
        },
        {
            name: '珍珠婚',
            age: 30
        },
        {
            name: '珊瑚婚',
            age: 35
        },
        {
            name: '红宝石婚',
            age: 40
        },
        {
            name: '蓝宝石婚',
            age: 45
        },
        {
            name: '金婚',
            age: 50
        },
        {
            name: '绿宝石婚',
            age: 55
        },
        {
            name: '钻石婚',
            age: 60
        },
        {
            name: '白金婚',
            age: 70
        }
    ],
    anniversary: [//纪念日列表
        {
            name: '恋爱纪念日',
            date: '2019-03-27',
            type: 0
        },
        {
            name: '领证纪念日',
            date: '2021-07-14',
            type: 1
        },
        {
            name: '订婚纪念日',
            date: '2021-12-28',
            type: 2
        },
        {
            name: '结婚纪念日',
            date: '2023-12-16',
            type: 2
        }
    ],
    birthday: [//生日列表
        {
            name: 'Mon生日',
            date: '1972-01-12'
        },
        {
            name: 'Mother生日',
            date: '1971-02-03'
        },
        {
            name: 'Dad生日',
            date: '1970-02-14'
        },
        {
            name: 'Grandfather生日',
            date: '1939-08-02'
        },
        {
            name: 'Xiang生日',
            date: '1992-09-18'
        },
        {
            name: 'Lover生日',
            date: '1995-10-01'
        },
        {
            name: 'Father生日',
            date: '1969-11-23'
        },
        {
            name: 'Brother生日',
            date: '2000-12-15'
        }
    ],
    legal: [//法定节假日列表(根据国务院公布情况)
        {
            name:'元旦',
            date: '01-01',
            freeway: 0,
            repair: 0,
            holiday: ['01-01']
        },
        {
            name:'春节',
            date: '01-29',
            freeway: 1,
            repair: ['01-26','02-08'],
            holiday: ['01-28','01-29','01-30','01-31','02-01','02-02','02-03','02-04']
        },
        {
            name:'清明节',
            date: '04-04',
            freeway: 1,
            repair: 0,
            holiday: ['04-04','04-05','04-06']
        },
        {
            name:'劳动节',
            date: '05-01',
            freeway: 1,
            repair: ['04-27'],
            holiday: ['05-01','05-02','05-03','05-04','05-05']
        },
        {
            name:'端午节',
            date: '05-31',
            freeway: 0,
            repair: 0,
            holiday: ['05-31','06-01','06-02']
        },
        {
            name:'国庆节',
            date: '10-01',
            freeway: 1,
            repair: ['09-28','10-11'],
            holiday: ['10-01','10-02','10-03','10-04','10-05']
        },
        {
            name:'中秋节',
            date: '10-06',
            freeway: 0,
            repair: 0,
            holiday: ['10-06','10-07','10-08']
        }
    ],
    sFtv: [//阳历节日列表
        {
            name: '警察节',
            date: '01-10'
        },
        {
            name: '气象节',
            date: '02-10'
        },
        {
            name: '情人节',
            date: '02-14'
        },
        {
            name: '妇女节',
            date: '03-08'
        },
        {
            name: '植树节',
            date: '03-12'
        },
        {
            name: '国医节',
            date: '03-17'
        },
        {
            name: '愚人节',
            date: '04-01'
        },
        {
            name: '青年节',
            date: '05-04'
        },
        {
            name: '护士节',
            date: '05-12'
        },
        {
            name: '520情人节',
            date: '05-20'
        },
        {
            name: '儿童节',
            date: '06-01'
        },
        {
            name: '618购物节',
            date: '06-18'
        },
        {
            name: '建党节',
            date: '07-01'
        },
        {
            name: '建军节',
            date: '08-01'
        },
        {
            name: '男子节',
            date: '08-08'
        },
        {
            name: '医师节',
            date: '08-19'
        },
        {
            name: '教师节',
            date: '09-10'
        },
        {
            name: '老人节',
            date: '10-06'
        },
        {
            name: '盲人节',
            date: '10-15'
        },
        {
            name:'程序员节',
            date: '10-24'
        },
        {
            name:'万圣节',
            date: '11-01'
        },
        {
            name:'双十一购物节',
            date: '11-11'
        },
        {
            name: '大学生节',//世界学生节
            date: '11-17'
        },
        {
            name:'平安夜',
            date: '12-24'
        },
        {
            name:'圣诞节',
            date: '12-25'
        }
    ],
    lFtv: [//阴历节日列表
        {
            name:'上元节',
            date: '01-15'
        },
        {
            name:'龙头节',
            date: '02-02'
        },
        {
            name:'上巳节',
            date: '03-03'
        },
        {
            name:'佛诞节',
            date: '04-08'
        },
        {
            name:'七夕节',
            date: '07-07'
        },
        {
            name:'中元节',
            date: '07-15'
        },
        {
            name:'重阳节',
            date: '09-09'
        },
        {
            name:'下元节',
            date: '10-15'
        },
        {
            name:'腊八节',
            date: '12-08'
        },
        {
            name:'北小年',
            date: '12-23'
        },
        {
            name:'南小年',
            date: '12-24'
        },
        {
            name:'江浙沪小年',
            date: '12-29'
        },
        {
            name:'除夕',
            date: '12-30'
        }
    ],
    term: [//二十四节气列表
        {
            sort: 1,
            name:'立春',
            month: '02'
        },
        {
            sort: 2,
            name:'雨水',
            month: '02'
        },
        {
            sort: 3,
            name:'惊蛰',
            month: '03'
        },
        {
            sort: 4,
            name:'春分',
            month: '03'
        },
        {
            sort: 5,
            name:'谷雨',
            month: '04'
        },
        {
            sort: 7,
            name:'立夏',
            month: '05'
        },
        {
            sort: 8,
            name:'小满',
            month: '05'
        },
        {
            sort: 9,
            name:'芒种',
            month: '06'
        },
        {
            sort: 10,
            name:'夏至',
            month: '06'
        },
        {
            sort: 11,
            name:'小暑',
            month: '07'
        },
        {
            sort: 12,
            name:'大暑',
            month: '07'
        },
        {
            sort: 13,
            name:'立秋',
            month: '08'
        },
        {
            sort: 14,
            name:'处暑',
            month: '08'
        },
        {
            sort: 15,
            name:'白露',
            month: '09'
        },
        {
            sort: 16,
            name:'秋分',
            month: '09'
        },
        {
            sort: 17,
            name:'寒露',
            month: '10'
        },
        {
            sort: 18,
            name:'霜降',
            month: '10'
        },
        {
            sort: 19,
            name:'立冬',
            month: '11'
        },
        {
            sort: 20,
            name:'小雪',
            month: '11'
        },
        {
            sort: 21,
            name:'大雪',
            month: '12'
        },
        {
            sort: 22,
            name:'冬至',
            month: '12'
        },
        {
            sort: 23,
            name:'小寒',
            month: '01'
        },
        {
            sort: 24,
            name:'大寒',
            month: '01'
        }
    ],
    special: [//特殊节日列表
        {
            name:'世界防治麻风病日',//每年1月的最后一个星期日
            date: '01/4/7'
        },
        {
            name:'母亲节',//每年5月的第二个星期日
            date: '05/2/7'
        },
        {
            name:'全国助残日',//每年5月第三个星期日
            date: '05/3/7'
        },
        {
            name:'父亲节',//每年6月的第三个星期日
            date: '06/3/7'
        },
        {
            name:'国际和平日',//每年9月的第三个星期二
            date: '09/3/2'
        },
        {
            name:'国际聋人节',//世界儿童日|每年9月的第四个星期日
            date: '09/4/7'
        },
        {
            name:'国际住房日',//每年10月的第一个星期一
            date: '10/1/1'
        },
        {
            name:'国际减轻自然灾害日',//每年10月的第二个星期三
            date: '10/2/3'
        },
        {
            name:'感恩节',//每年11月的第四个星期四
            date: '11/4/4'
        }
        //世界海事日: 每年9月的最后一周
    ],
    internation: [//国际节日列表
        {
            name: '周恩来逝世纪念日',//1976年
            date: '01-08'
        },
        {
            name: '国际海关日',
            date: '01-26'
        },
        {
            name: '世界湿地日',
            date: '02-02'
        },
        {
            name: '国际海豹日',
            date: '03-01'
        },
        {
            name: '全国爱耳日',
            date: '03-03'
        },
        {
            name: '周恩来诞辰纪念日', //1898年、学雷锋纪念日
            date: '03-05'
        },
        {
            name:'孙中山逝世纪念日', //1925年
            date: '03-12'
        },
        {
            name:'国际警察日',
            date: '03-14'
        },
        {
            name:'消费者权益日',
            date: '03-15'
        },
        {
            name:'国际航海日',
            date: '03-17'
        },
        {
            name: '世界睡眠日',//世界森林日, 消除种族歧视国际日', 世界儿歌日
            date: '03-21'
        },
        {
            name: '世界水日',
            date: '03-22'
        },
        {
            name: '世界气象日',
            date: '03-23'
        },
        {
            name: '世界防治结核病日',
            date: '03-24'
        },
        {
            name: '学生安全教育日',
            date: '03-25'
        },
        {
            name: '世界卫生日',
            date: '04-07'
        },
        {
            name: '世界地球日',
            date: '04-22'
        },
        {
            name: '世界图书和版权日',
            date: '04-23'
        },
        {
            name: '中国航天日',//亚非新闻工作者日
            date: '04-24'
        },
        {
            name: '知识产权日',
            date: '04-26'
        },
        {
            name:'碘缺乏病防治日',
            date: '05-05'
        },
        {
            name:'世界红十字日',
            date: '05-08'
        },
        {
            name:'国际家庭日',
            date: '05-15'
        },
        {
            name:'国际电信日',
            date: '05-17'
        },
        {
            name:'国际博物馆日',
            date: '05-18'
        },
        {
            name:'全国学生营养日',
            date: '05-20'
        },
        {
            name:'国际牛奶日',
            date: '05-23'
        },
        {
            name: '世界无烟日',
            date: '05-31'
        },
        {
            name: '世界环境日',
            date: '06-05'
        },
        {
            name: '全国爱眼日',
            date: '06-06'
        },
        {
            name: '治荒漠化和干旱日',
            date: '06-17'
        },
        {
            name: '国际奥林匹克日',
            date: '06-23'
        },
        {
            name: '全国土地日',
            date: '06-25'
        },
        {
            name: '国际禁毒日',
            date: '06-26'
        },
        {
            name: '香港回归纪念日',//1997年、 中国共产党诞辰、世界建筑日
            date: '07-01'
        },
        {
            name: '国际体育记者日',
            date: '07-02'
        },
        {
            name: '世界人口日',
            date: '07-11'
        },
        {
            name:'抗日战争胜利纪念日', //1945年
            date: '09-03'
        },
        {
            name:'国际扫盲日',
            date: '09-08'
        },
        {
            name:'毛泽东逝世纪念日', //1976年
            date: '09-09'
        },
        {
            name:'世界清洁地球日',
            date: '09-14'
        },
        {
            name:'国际臭氧层保护日',
            date: '09-16'
        },
        {
            name:'九一八事变纪念日', //1931年
            date: '09-18'
        },
        {
            name: '国际爱牙日',
            date: '09-20'
        },
        {
            name: '国际和平日',
            date: '09-21'
        },
        {
            name: '世界旅游日',
            date: '09-27'
        },
        {
            name: '孔子诞辰纪念日', //公元前551年
            date: '09-28'
        },
        {
            name: '中国烈士纪念日',
            date: '09-30'
        },
        {
            name: '世界音乐日',//国际老人节
            date: '10-01'
        },
        {
            name: '国际和平斗争日',
            date: '10-02'
        },
        {
            name: '世界动物日',
            date: '10-04'
        },
        {
            name: '全国高血压日',//世界视觉日
            date: '10-08'
        },
        {
            name: '世界邮政日',//万国邮联日
            date: '10-09'
        },
        {
            name: '辛亥革命纪念日',//1911年、世界精神卫生日
            date: '10-10'
        },
        {
            name: '世界保健日',
            date: '10-13'
        },
        {
            name: '世界标准日',
            date: '10-14'
        },
        {
            name: '世界粮食日',
            date: '10-16'
        },
        {
            name: '世界消除贫困日',
            date: '10-17'
        },
        {
            name: '世界传统医药日',
            date: '10-22'
        },
        {
            name: '联合国日',
            date: '10-24'
        },
        {
            name: '抗美援朝纪念日',//1950年
            date: '10-25'
        },
        {
            name: '世界勤俭日',
            date: '10-31'
        },
        {
            name: '中国记者日',
            date: '11-08'
        },
        {
            name: '全国消防日',
            date: '11-09'
        },
        {
            name: '孙中山诞辰纪念日',//1866年
            date: '11-12'
        },
        {
            name: '世界糖尿病日',
            date: '11-14'
        },
        {
            name: '国际宽容日',
            date: '11-16'
        },
        {
            name: '世界问候日',//世界电视日
            date: '11-21'
        },
        {
            name: '世界艾滋病日',
            date: '12-01'
        },
        {
            name: '中国宪法日',
            date: '12-04'
        },
        {
            name: '国际残疾人日',
            date: '12-03'
        },
        {
            name: '国际志愿者日',
            date: '12-05'
        },
        {
            name: '国际儿童电视日',
            date: '12-08'
        },
        {
            name: '世界足球日',
            date: '12-09'
        },
        {
            name: '世界人权日',
            date: '12-10'
        },
        {
            name: '西安事变纪念日',//1936年
            date: '12-12'
        },
        {
            name: '南京大屠杀纪念日',//1937年
            date: '12-13'
        },
        {
            name:'澳门回归纪念日',//1999年
            date: '12-20'
        },
        {
            name:'国际篮球日',
            date: '12-21'
        },
        {
            name:'毛泽东诞辰纪念日',//1898年
            date: '12-26'
        }
    ],
    license: [//证件有效期列表
        {
            name:'Agile租房合同',
            date: '2025-02-28'
        },
        {
            name:'Agile-Q4租房',
            date: '2024-12-01'
        },
        {
            name:'CMCC宽带',
            date: '2025-03-01'
        },
        {
            name:'Skoda车险',
            date: '2025-12-14'
        },
        {
            name:'Skoda年检',
            date: '2026-12-31'
        },
        {
            name:'Fang身份证',
            date: '2043-03-17'
        },
        {
            name:'Fang驾驶证',
            date: '2031-03-10'
        },
        {
            name:'Xiang身份证',
            date: '2041-03-11'
        },
        {
            name:'Xiang驾驶证',
            date: '2034-09-07'
        },
        {
            name:'Xiang居住证',
            date: '2025-06-19'
        },
        {
            name:'Mon身份证',
            date: '2026-06-06'
        },
        {
            name:'Dad身份证',
            date: '2026-06-04'
        }
    ]
}

//汽油价格模块
let gasoline = {
    open: true,//是否需要汽油价格，需要填true，否则填false （不需要加引号）
    province: ['浙江','福建','安徽'],//地区名称
    model: ['0号柴油','92号汽油','95号汽油','98号汽油'],//汽油型号
}

//结束语模块
let end = {
    open: false,//是否需要推送时增加结束语，需要填true，否则填false  （不需要加引号）
    content: '本通知 By 狂欢马克思',//结束语内容，可以输入emoji表情，可以使用 \n 来换行
    time: '通知时间: '
}

//课表推送模块
let classTable = {
    open: false,//是否需要推送时增加课表，需要填true，否则填false  （不需要加引号）
    graduate: '2024-07-10',
    homework: '2023-12-30', // homework: 0,
    computer: [//22春计算机本-课程列表
        {
            name: '数学文化',//课程名称
            teacher: '韩玉娟',//辅导老师
            exam: 0,
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-12',
                    time: '18:30 - 20:00',//课程时间
                    place: '浙江开放大学-行政楼A702'//上课地点
                }
            ]
        },
        {
            name: '计算机网络',//课程名称
            teacher: '蒋融融',//辅导老师
            exam: {
                type: 1, //考试方式 1:纸质闭卷 2:上机闭卷
                date: '2024-01-06',
                time: '08:30 - 10:00',//考试时间
                place: '浙江开放大学B301-27'//考试地点
            },
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-11-02',
                    time: '18:30 - 20:00',//课程时间
                    place: '浙江开放大学-行政楼A717'//上课地点
                }
            ]
        },
        {
            name: '人工智能导论',//课程名称
            teacher: '余燕芳',//辅导老师
            exam: 0,
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-22',
                    time: '18:30 - 20:00',//课程时间
                    place: '浙江开放大学-行政楼A717'//上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-29',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-11-05',
                    time: '18:30 - 20:00',//课程时间
                    place: '浙江开放大学-行政楼A717'//上课地点
                }
            ]
        },
        {
            name: '数据库应用技术',//课程名称
            teacher: '刘旭东',//辅导老师
            exam: {
                type: 1, //考试方式 1:纸质闭卷 2:上机闭卷
                date: '2024-01-06',
                time: '11:00 - 12:30',//考试时间
                place: '浙江开放大学B303-48'//考试地点
            },
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-09-20',
                    time: '18:30 - 20:00',//课程时间
                    place: '浙江开放大学-行政楼A713'//上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-09-27',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-11',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-18',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-25',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-11-01',
                    time: '18:30 - 20:00',//课程时间
                    place: '浙江开放大学-行政楼A713'//上课地点
                }
            ]
        },
        {
            name: '毕业论文',//课程名称
            teacher: '陈晓薇',//辅导老师
            //exam: 0,
            exam: {
                type: 2, //考试方式 1:纸质闭卷 2:上机闭卷
                date: '2024-05-28',
                time: '09:00 - 11:00',//考试时间
                place: '浙江开放大学'//考试地点
            },
            classList: [
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-09-20',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                }
            ]
        }
    ],
    hr: [//22春行政专-课程列表
        {
            name: '监督学',//课程名称
            teacher: '俞丹',//辅导老师
            exam: {
                type: 1, //考试方式 1:纸质闭卷 2:上机闭卷
                date: '2024-01-13',
                time: '16:30 - 17:30',//考试时间
                place: '浙江开放大学'//考试地点
            },
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-30',
                    time: '18:30 - 20:50',//课程时间
                    place: '浙江开放大学-行政楼A702' //上课地点
                },
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-11-06',
                    time: '18:30 - 20:00',//课程时间
                    place: '浙江开放大学-行政楼A702' //上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-11-13',
                    time: '18:30 - 20:50',//课程时间
                    place: 0 //上课地点
                }
            ]
        },
        {
            name: '办公室管理',//课程名称
            teacher: '朱庆好',//辅导老师
            exam: {
                type: 1, //考试方式 1:纸质闭卷 2:上机闭卷
                date: '2024-01-14',
                time: '11:00 - 12:00',//考试时间
                place: '浙江开放大学A602-28'//考试地点
            },
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-12-14',
                    time: '18:30 - 20:50',//课程时间
                    place: '浙江开放大学-行政楼A709' //上课地点
                }
            ]
        },
        {
            name: '国家赔偿法',//课程名称
            teacher: '林卉',//辅导老师
            exam: {
                type: 1, //考试方式 1:纸质闭卷 2:上机闭卷
                date: '2023-12-24',
                time: '08:30 - 09:30',//考试时间
                place: '浙江开放大学B301-6'//考试地点
            },
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-15',
                    time: '09:05 - 11:25',//课程时间
                    place: '浙江开放大学-行政楼A702' //上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-16',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-23',
                    time: '18:30 - 20:00',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-10-29',
                    time: '09:05 - 11:25',//课程时间
                    place: '浙江开放大学-行政楼A702' //上课地点
                }
            ]
        },
        {
            name: '行政组织学',//课程名称
            teacher: '俞丹',//辅导老师
            exam: {
                type: 1, //考试方式 1:纸质闭卷 2:上机闭卷
                date: '2024-01-13',
                time: '08:30 - 09:30',//考试时间
                place: '浙江开放大学A602-28'//考试地点
            },
            classList: [
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-11-20',
                    time: '18:30 - 20:50',//课程时间
                    place: '浙江开放大学-行政楼A702' //上课地点
                },
                {
                    type: 1, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-11-27',
                    time: '18:30 - 20:50',//课程时间
                    place: 0 //上课地点
                },
                {
                    type: 2, //教学方式 1:钉钉直播 2:线下教室
                    date: '2023-12-04',
                    time: '18:30 - 20:50',//课程时间
                    place: '浙江开放大学-行政楼A702' //上课地点
                }
            ]
        }
    ]
}

//是否需要艾特所有人
let atAll = false //是否需要艾特所有人，需要填true，否则填false （不需要加引号）

//彩虹屁模块
let sentence = {
    open: true,//是否需要彩虹屁文案，需要填true，否则填false （不需要加引号）
}

//下面的内容请勿改动
module.exports = { robotPush, start, news, lottery, weather, daily, gasoline, end, atAll, classTable, sentence }
